# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple (controlla n° ripetizone blocchi) (number*depth)
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# volendo posso passare 'activation'
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args[channel_out,kernel,stride,padding]
  [[-1, 1, Conv, [128, 4, 4, 0]],  # 0-P2/4
   [-1, 3, C3Next, [128]],      # 1
   [-1, 1, Conv, [256, 2, 2, 0]],  # 2-P3/8
   [-1, 6, C3Next, [256]],      # 3
   [-1, 1, Conv, [512, 2, 2, 0]],  # 4-P4/16
   [-1, 9, C3Next, [512]],      # 5
   [-1, 1, Conv, [1024, 2, 2, 0]],  # 6-P5/32
   [-1, 3, C3Next, [1024]],     # 7
   [-1, 1, SPPF, [1024, 5]],  # 8
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1, 0]], # 9
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 10
   [[-1, 5], 1, Concat, [1]],  # 11 cat backbone P4
   [-1, 3, C3Next, [512, False]],  # 12

   [-1, 1, Conv, [256, 1, 1, 0]],  # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 14
   [[-1, 3], 1, Concat, [1]],  # 15 cat backbone P3
   [-1, 3, C3Next, [256, False]],  # 16 (P3/8-small)

   [-1, 1, Conv, [256, 2, 2, 0]],  # 17
   [[-1, 13], 1, Concat, [1]],  # 18 cat head P4
   [-1, 3, C3Next, [512, False]],  # 19 (P4/16-medium)

   [-1, 1, Conv, [512, 2, 2, 0]], # 20
   [[-1, 9], 1, Concat, [1]],  # 21 cat head P5
   [-1, 3, C3Next, [1024, False]],  # 22 (P5/32-large)

   [[16, 19, 22], 1, Detect, [nc, anchors]],  # 23 Detect(P3, P4, P5)
  ]
