# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 0.67  # model depth multiple (controlla n° ripetizone blocchi) (number*depth)
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# volendo posso passare 'activation'

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args[channel_out,kernel,stride,padding]
  [[-1, 1, Stem, [128, 4, 4, 0]],    #(stem)
   [-1, 1, LayerNorm,''],
   [-1, 3, ConvNextBlock, [128]],
   [-1, 1, LayerNorm,''],
   [-1, 1, DownSample, [256, 2, 2, 0]],
   [-1, 3, ConvNextBlock, [256]],
   [-1, 1, LayerNorm,''],                #C1
   [-1, 1, DownSample, [512, 2, 2, 0]],
   [-1, 9, ConvNextBlock, [512]],
   [-1, 1, LayerNorm,''],                #C2
   [-1, 1, DownSample, [1024, 2, 2, 0]],
   [-1, 3, ConvNextBlock, [1024]],
   [-1, 1, SPPFConvNext, [1024, 5]],
   [-1, 1, LayerNorm,''],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #H3
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat C2
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [256, 1, 1]], #H4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat C1
   [-1, 3, C3, [256, False]],  #  (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat H4
   [-1, 3, C3, [512, False]],  #  (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat H3
   [-1, 3, C3, [1024, False]],  #  (P5/32-large)

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
