# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[ -1, 1, CBL, [64, 7, 2, 3 ] ], #0 # kernel,stride,padding
   [ -1, 1, maxpool2d, [ 3, 2, 1 ] ], #1
   [ -1, 3, Residual_CSP, [256 ,1] ], #2
   [ -1, 1, CBL, [ 256, 3, 2, 1] ], #3
   [ -1, 6, Residual_CSP, [ 256, 1 ]], #4
   [ -1, 1, CBL, [ 512, 3, 2, 1 ]], #5
   [ -1, 9, Residual_CSP, [ 512, 1] ], #6
   [ -1, 1, CBL, [ 1024, 3, 2, 1] ], #7
   [ -1, 3, Residual_CSP, [ 1024, 1] ], #8
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #9 # il quarto va concatenato a questo
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #10
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 #11
   [-1, 3, C3, [512, False]],  # 12

   [-1, 1, Conv, [256, 1, 1]], # 13 il terzo va concatenato a questo
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #14
   [[-1, 4], 1, Concat, [1]],  # 15 cat backbone P3
   [-1, 3, C3, [256, False]],  # 16 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], #17
   [[-1, 13], 1, Concat, [1]],  #18 cat head P4
   [-1, 3, C3, [512, False]],  # 19 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], #20
   [[-1, 9], 1, Concat, [1]],  #21 cat head P5
   [-1, 3, C3, [1024, False]],  # 22 (P5/32-large)

   [[16, 19, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

