# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple (controlla n° ripetizone blocchi) (number*depth)
width_multiple: 0.5  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# volendo posso passare 'activation'
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args[channel_out,kernel,stride,padding]
  [[-1, 1, Conv, [64, 6, 2, 2]],       # 0
   [-1, 1, Conv, [128, 3, 2]],         # 1
   [-1, 3, CSPResNextBlock, [128, 32]],    # 2
   [-1, 1, Conv, [256, 3, 2]],         # 3
   [-1, 6, CSPResNextBlock, [256, 32]],    # 4  P3
   [-1, 1, Conv, [512, 3, 2]],         # 5
   [-1, 9, CSPResNextBlock, [512, 32]],    # 6  P4
   [-1, 1, Conv, [1024, 3, 2]],        # 7
   [-1, 3, CSPResNextBlock, [1024, 32]],   # 8
   [-1, 1, SPPF, [1024, 5]],           # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                   # 10 H5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 11
   [[-1, 6], 1, Concat, [1]],                    # 12 cat P4
   [-1, 3, CSPResNextBlock, [512, 32]],              # 13

   [-1, 1, Conv, [256, 1, 1]],                   # 14 H4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 15
   [[-1, 4], 1, Concat, [1]],                    # 16 cat P3
   [-1, 3, CSPResNextBlock, [256, 32]],              # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                   # 18
   [[-1, 14], 1, Concat, [1]],                   # 19 cat H4
   [-1, 3, CSPResNextBlock, [512, 32]],              # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                   # 21
   [[-1, 10], 1, Concat, [1]],                   # 22 cat H5
   [-1, 3, CSPResNextBlock, [1024, 32]],             # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],     # 24 Detect(P3, P4, P5)
  ]
